; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 373888 1 2 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image2 - mode
	thermograph0 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Planet8 infrared1)
	(have_image Planet9 image2)
	(have_image Star10 infrared1)
	(have_image Star11 image2)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star13)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 star13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star13)
   goals met: 0 of 7
6. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 1 of 7
7. (turn_to satellite0 star11 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star11)
   goals met: 1 of 7
8. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 2 of 7
9. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
10. (take_image satellite0 star10 instrument0 infrared1)
   added: (have_image star10 infrared1)
   goals met: 3 of 7
11. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 3 of 7
12. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 4 of 7
13. (turn_to satellite0 planet8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet8)
   goals met: 4 of 7
14. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 5 of 7
15. (turn_to satellite0 phenomenon12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 7
16. (take_image satellite0 phenomenon12 instrument0 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 6 of 7
17. (turn_to satellite0 groundstation4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation4)
   goals met: 7 of 7
